{
  "Əsas bacarıqlar": "Basic skills",
  "Tel": "Phone",
  "Şəhər": "City",
  "Azərbaycan": "Azerbaijan",
  "Təhsil": "Education",
  "Mən, React, TypeScript və müasir CSS framework-lərindən istifadə edərək ideyaları interaktiv veb təcrübələrə çevirən praktiki təcrübəyə malik bir Frontend Developeram. Piksel dəqiqliyində dizayna, performansa və təmiz koda xüsusi önəm verirəm.": "I am a Frontend Developer with hands-on experience turning ideas into interactive web experiences using React, TypeScript, and modern CSS frameworks. I focus on pixel-perfect design, performance, and clean code.",
  "Azerbaijan Dövlət Neft və Sənaye Universiteti": "Azerbaijan State Oil and Industry University",
  "Kompyuter mühəndisliyi": "Computer engineering",
  "ASOİU-da təhsil aldığım müddətdə alqoritmlər, verilənlər strukturu, proqram mühəndisliyi və web development sahələrində biliklər əldə etmişəm. Layihələrim vasitəsilə praktiki bacarıqlarımı artırmışam və müxtəlif texnologiyalarla işləmə təcrübəsi qazanmışam.": "During my studies at ASOIU, I gained knowledge in the fields of algorithms, data structures, software engineering, and web development. Through my projects, I have improved my practical skills and gained experience working with various technologies.",
  "Azərbaycan Dövlət Təhsil və Elm nazirliyi tərəfindən təşkil edilmiş 'CodeForFuture' layihəsin də Front end developer təlimini bitirmişəm. Honour sertifikatı ilə təltif olunmuşam.": "I have also completed the Front End Developer training course of the 'CodeForFuture' project organized by the Ministry of Education and Science of Azerbaijan. I was awarded an Honor certificate.",
  "Əlaqə saxla": "Contact us",
  "Bu, onlayn satış üçün nəzərdə tutulmuş veb səhifədir. Layihədə TypeScript, Framer Motion, komponent əsaslı arxitektura və digər müasir React texnologiyalarından istifadə olunmuşdur.": "This is a website designed for online sales. The project uses TypeScript, Framer Motion, component-based architecture, and other modern React technologies.",
  "Bu, müxtəlif mebel məhsullarının onlayn satışını təmin edən veb səhifədir. Saytın frontend hissəsi React, TypeScript, Framer Motion və Redux kimi texnologiyalarla qurulmuşdur. Backend isə Express.js və MongoDB istifadə edilərək hazırlanmışdır. Saytda məhsul filtrasiyası, kateqoriya əsaslı axtarış, istifadəçi hesabları, səbət funksionallığı və dinamik animasiyalar mövcuddur.": "This is a website that provides online sales of various furniture products. The frontend of the site is built with technologies such as React, TypeScript, Framer Motion and Redux. The backend is developed using Express.js and MongoDB. The site has product filtering, category-based search, user accounts, cart functionality and dynamic animations.",
  "React-da yaratdğım bu saytda json obyekt üzərin də işləyərək məlumatları gətirib səhifə də göstərmişəm. Json obyekt içərisin də axtarış etmək, səbətə məhsul əlavə etmək, silmək, sayını artırıb-azaltmaq, ümumi qiyməti görmək üçün bu funksiyaları etmişəm.": "In this website I created in React, I have also worked on the json object and brought the data to the page. I have done these functions to search inside the json object, add products to the cart, delete, increase or decrease the number, and see the total price.",
  "AMO Corporate Group üçün hazırladığım veb sayt React və TypeScript ilə yazılmışdır. Hal-hazırda deploy olunmayıb. Gözlənilir.": "The website I developed for AMO Corporate Group is written in React and TypeScript. It is not currently deployed. It is expected.",
  "'Coza Store' adlanan bu E-Commerce veb səhifəsini Fake Store API-dan istifadə edərək hazırlamışam. Layihəni React ilə həyata keçirmişəm. Autentifikasiya və autorizasiya əməliyyatlarını Node JS ilə icra etmişəm. Github-dan endirərək serveri başladıb baxa bilərsiz": "I developed this E-Commerce website called 'Coza Store' using the Fake Store API. I implemented the project with React. I performed authentication and authorization operations with Node JS. You can download it from Github and start the server and watch",
  "Burada şəhərlər üzrə axtarış edərək hava şəraitini göstərir.": "Here it shows the weather by searching for cities.",
  "Burada istədiyiniz kinoları axtarış edə bilərsiz. Kinonu listə əlavə edə bilərsiz. Listin adını qoya bilərsiz. Kinonun omdbAPİ-a gedib o kinonu göstərir.": "Here you can search for the movies you want. You can add the movie to the list. You can name the list. You can go to the movie's omdbAPI and show that movie.",
  "TypeScript-də yeni başladığım üçün sadə dizayn bir todo list app düzəltməyi fikirləşdim. Sadə olmasa da düzəltməyi bacardıq. Redux-toolkit istifadə edərək ərsəyə gətirdim": "Since I am new to TypeScript, I thought of making a simple design todo list app. Although it is not simple, we managed to make it. I created it using Redux-toolkit",
  "Təcrübə": "Experience",
  "Keçid et": "Go to",
  "• React.js, TypeScript, Material UI, Tailwind CSS istifadə edərək API-larla işləyən modern veb sayt hazırladım.\n• Müştəri tələblərinə uyğun şəkildə adaptiv və funksional interfeyslər dizayn etdim.\n• Framer motion vasitəsilə animasiyalı veb saytlar hazırladım": "• I developed a modern website that works with APIs using React.js, TypeScript, Material UI, Tailwind CSS.\n• I designed adaptive and functional interfaces according to customer requirements.\n• I developed animated websites using Framer motion",
  "• React.js, TypeScript, Material UI, Tailwind CSS istifadə edərək API-larla işləyən modern veb sayt hazırladım.\n• Web API-lərlə inteqrasiya olunmuş real layihələr üzərində işlədim.\n• Bitrix24-ün Web API-ları ilə işlədim. \n• ERP və CRM sistemləri ilə tanış oldum.\n• Bitrix24 və Odoo platformaları ilə işlədim.": "• I developed a modern website that works with APIs using React.js, TypeScript, Material UI, Tailwind CSS.\n• I worked on real projects integrated with Web APIs.\n• I worked with Bitrix24's Web APIs. \n• I got acquainted with ERP and CRM systems.\n• I worked with Bitrix24 and Odoo platforms.",
  "• HTML, CSS və JavaScript istifadə edərək müxtəlif səhifələr və komponentlər hazırladım.\n• Verilən tapşırıqları vaxtı vaxtında yerinə yetirdim\n": "• I developed various pages and components using HTML, CSS, and JavaScript.\n• I completed the assigned tasks on time\n",
  "Əlaqə Saxla": "Contact Us",
  "Ad": "Name",
  "Mövzu": "Subject",
  "Mesaj": "Message",
  "Mesaj göndər": "Send message",
  "Ölkə": "Country",
  "Küçə": "Street",
  "Ö.F. Nemanzadə küç 28": "Ö.F. Nemanzade street 28"
}
