{
  "Əsas bacarıqlar": "Basic skills",
  "Tel": "Phone",
  "Şəhər": "City",
  "Azərbaycan": "Azerbaijan",
  "Təhsil": "Education",
  "Mən, React, TypeScript və müasir CSS framework-lərindən istifadə edərək ideyaları interaktiv veb təcrübələrə çevirən praktiki təcrübəyə malik bir Frontend Developeram. Piksel dəqiqliyində dizayna, performansa və təmiz koda xüsusi önəm verirəm. Flutter sahəsin də təcrübə qazanmağa və real layihələr də iştirak etməyə həvəsliyəm. Front end developer təcrübəsinə sahib bir developerəm": "I am a Frontend Developer with hands-on experience turning ideas into interactive web experiences using React, TypeScript, and modern CSS frameworks. I focus on pixel-perfect design, performance, and clean code. I am eager to gain experience in the Flutter field and participate in real projects. I am a developer with front end developer experience.",
  "Azerbaijan Dövlət Neft və Sənaye Universiteti": "Azerbaijan State Oil and Industry University",
  "Kompyuter mühəndisliyi": "Computer engineering",
  "ASOİU-da təhsil aldığım müddətdə alqoritmlər, verilənlər strukturu, proqram mühəndisliyi və web development sahələrində biliklər əldə etmişəm. Layihələrim vasitəsilə praktiki bacarıqlarımı artırmışam və müxtəlif texnologiyalarla işləmə təcrübəsi qazanmışam.": "During my studies at ASOIU, I gained knowledge in the fields of algorithms, data structures, software engineering, and web development. Through my projects, I have improved my practical skills and gained experience working with various technologies.",
  "Azərbaycan Dövlət Təhsil və Elm nazirliyi tərəfindən təşkil edilmiş 'CodeForFuture' layihəsin də Front end developer təlimini bitirmişəm. Honour sertifikatı ilə təltif olunmuşam.": "I have also completed the Front End Developer training course of the 'CodeForFuture' project organized by the Ministry of Education and Science of Azerbaijan. I was awarded an Honor certificate.",
  "Əlaqə saxla": "Contact us",
  "Bu, onlayn satış üçün nəzərdə tutulmuş veb səhifədir. Layihədə TypeScript, Framer Motion, komponent əsaslı arxitektura və digər müasir React texnologiyalarından istifadə olunmuşdur.": "This is a website designed for online sales. The project uses TypeScript, Framer Motion, component-based architecture, and other modern React technologies.",
  "Bu, müxtəlif mebel məhsullarının onlayn satışını təmin edən veb səhifədir. Saytın frontend hissəsi React, TypeScript, Framer Motion və Redux kimi texnologiyalarla qurulmuşdur. Backend isə Express.js və MongoDB istifadə edilərək hazırlanmışdır. Saytda məhsul filtrasiyası, kateqoriya əsaslı axtarış, istifadəçi hesabları, səbət funksionallığı və dinamik animasiyalar mövcuddur.": "This is a website that provides online sales of various furniture products. The frontend of the site is built with technologies such as React, TypeScript, Framer Motion and Redux. The backend is developed using Express.js and MongoDB. The site has product filtering, category-based search, user accounts, cart functionality and dynamic animations.",
  "React-da yaratdğım bu saytda json obyekt üzərin də işləyərək məlumatları gətirib səhifə də göstərmişəm. Json obyekt içərisin də axtarış etmək, səbətə məhsul əlavə etmək, silmək, sayını artırıb-azaltmaq, ümumi qiyməti görmək üçün bu funksiyaları etmişəm.": "In this website I created in React, I have also worked on the json object and brought the data to the page. I have done these functions to search inside the json object, add products to the cart, delete, increase or decrease the number, and see the total price.",
  "AMO Corporate Group üçün hazırladığım veb sayt React və TypeScript ilə yazılmışdır. Hal-hazırda deploy olunmayıb. Gözlənilir.": "The website I developed for AMO Corporate Group is written in React and TypeScript. It is not currently deployed. It is expected.",
  "'Coza Store' adlanan bu E-Commerce veb səhifəsini Fake Store API-dan istifadə edərək hazırlamışam. Layihəni React ilə həyata keçirmişəm. Autentifikasiya və autorizasiya əməliyyatlarını Node JS ilə icra etmişəm. Github-dan endirərək serveri başladıb baxa bilərsiz": "I developed this E-Commerce website called 'Coza Store' using the Fake Store API. I implemented the project with React. I performed authentication and authorization operations with Node JS. You can download it from Github and start the server and watch",
  "Burada şəhərlər üzrə axtarış edərək hava şəraitini göstərir.": "Here it shows the weather by searching for cities.",
  "Burada istədiyiniz kinoları axtarış edə bilərsiz. Kinonu listə əlavə edə bilərsiz. Listin adını qoya bilərsiz. Kinonun omdbAPİ-a gedib o kinonu göstərir.": "Here you can search for the movies you want. You can add the movie to the list. You can name the list. You can go to the movie's omdbAPI and show that movie.",
  "TypeScript-də yeni başladığım üçün sadə dizayn bir todo list app düzəltməyi fikirləşdim. Sadə olmasa da düzəltməyi bacardıq. Redux-toolkit istifadə edərək ərsəyə gətirdim": "Since I am new to TypeScript, I thought of making a simple design todo list app. Although it is not simple, we managed to make it. I created it using Redux-toolkit",
  "Təcrübə": "Experience",
  "Keçid et": "Go to",
  "ParkCinema layihəsində veb sayt və admin panel üzərində dəyişikliklər və optimizasiyalar etdim.\n Ideal Kredit platformasında funksional təkmilləşdirmələr həyata keçirdim.\n BQT admin panelində CRUD əməliyyatlarını və istifadəçi/rol idarəetməsi kimi funksionallıqları üzərin də işləyirəm.\n Layihələrdə Zustand ilə state management istifadə edərək mövcud kodların strukturlaşdırılmasını və performansını yaxşılaşdırdım.\n Backend developer ilə sıx əməkdaşlıq edərək inteqrasiya olunmuş API-lərlə məlumat axınını uğurla idarə etdim.": "I made changes and optimizations on the website and admin panel of the ParkCinema project.\nI implemented functional improvements on the Ideal Kredit platform.\nI am working on CRUD operations and user/role management functionalities in the BQT admin panel.\nUsing Zustand for state management, I improved the structuring and performance of existing code in the projects.\nI closely collaborated with the backend developer and successfully managed data flow with integrated APIs.",
  "React.js, TypeScript, Material UI, Tailwind CSS istifadə edərək API-larla işləyən modern veb sayt hazırladım.\n Web API-lərlə inteqrasiya olunmuş real layihələr üzərində işlədim.\n Bitrix24-ün Web API-ları ilə işlədim. \n ERP və CRM sistemləri ilə tanış oldum.\n Bitrix24 və Odoo platformaları ilə işlədim.": "I developed a modern website working with APIs using React.js, TypeScript, Material UI, and Tailwind CSS.\nI worked on real projects integrated with Web APIs.\nI worked with Bitrix24's Web APIs.\nI got acquainted with ERP and CRM systems.\nI worked with Bitrix24 and Odoo platforms.",
  "HTML, CSS və JavaScript istifadə edərək müxtəlif səhifələr və komponentlər hazırladım.\n Verilən tapşırıqları vaxtı vaxtında yerinə yetirdim": "I developed various pages and components using HTML, CSS, and JavaScript.\n I completed the assigned tasks on time",
  "Əlaqə Saxla": "Contact Us",
  "Ad": "Name",
  "Mövzu": "Subject",
  "Mesaj": "Message",
  "Mesaj göndər": "Send message",
  "Ölkə": "Country",
  "Küçə": "Street",
  "Ö.F. Nemanzadə küç 28": "Ö.F. Nemanzade street 28",
  "Bu mobil applikasiya da api-dan gələn hava məlumatını ekranda göstərmişəm. Burada dio paketindən istifadə edərək, məlumatları gətirmişəm. Geolocator və geocoding vasitəsilə istifadəçinin məkanını alıb istək atmışam": "In this mobile application, I have displayed the weather information coming from the API on the screen. Here, I have used the dio package to fetch the data. I have requested the user's location using geolocator and geocoding.",
  "Burada istifadəçi səhifə də aşağı doğru hərəkət elətdirdikcə api-dan məlumatlar gəlir. State management olaraq Provider istifadə etmişəm.": "Here, as the user scrolls down the page, data is received from the API. I have used a Provider as state management.",
  "TigHubad applikasiyasın da söz bazanızı artırmaq üçün lüğət proqramıdı. Burada test işliyərək sözün mənasını tapmaq, sözün deyilişinə qulaq asmaq və lüğətdən söz axtarmaq bu kimi funksionallıqlar düşünürəm. Hələki dizayn hazırlanır": "The TigHubad application is also a dictionary program to increase your vocabulary. Here, I am thinking of functionalities such as finding the meaning of a word by running a test, listening to the pronunciation of the word, and looking up words in the dictionary. The design is still being developed.",
  "Bu sayt kitabların satışı üçün nəzərdə tutulmuşdur. Saytın frontend hissəsi React, TypeScript, Framer Motion və Redux kimi texnologiyalarla qurulmuşdur. Backend isə firebase authentication üçün və supabase isə storage üçün istifadə etmişəm.": "This site is maintained for selling books. The frontend of the site is built with technologies such as React, TypeScript, Framer Motion and Redux. For the backend, I used firebase for authentication and supabase for storage.",
  "Zəhmət olmasa bütün sahələri doldurun": "Please fill all fields",
  "Mesaj uğurla göndərildi": "Message sent successfully",
  "Bu mobil applikasiyada Rick and Morty seriyasının personajlarını göstərmişəm. Burada dio paketindən istifadə edərək, məlumatları gətirmişəm. Rick and Morty API-dan istifadə etmişəm. Personajların şəkillərini, adlarını, statusunu, növünü göstərmişəm. Həmçinin personajın üzərinə kliklədikdə onun haqqında ətraflı məlumatları göstərir.": "In this mobile application, I have shown the characters of the Rick and Morty series. Here, I have used the dio package to fetch the data. I have used the Rick and Morty API. I have shown the pictures, names, status, and type of the characters. Also, when you click on the character, it shows detailed information about him.",
  "Bu, onlayn kredit xidmətləri üçün hazırlanmış veb səhifədir. Mövcud kod bazası üzərində əlavə funksionallıqlar yaratmışam və layihəni davamlı olaraq təkmilləşdirirəm. Və admin panel üzərin də işlər də davam edir": "This is a web page designed for online credit services. I have added additional functionalities on top of the existing codebase and continuously improve the project. Work on the admin panel is also ongoing.",
  "Bu, ParkCinema layihəsi üçün hazırlanmış veb tətbiqidir. Mövcud kod bazası üzərində işlər aparıram, yeni funksionallıqlar əlavə edir və saytın davamlı dəstəyi üçün çalışıram.": "This is a web application developed for the ParkCinema project. I work on the existing codebase, add new features, and provide ongoing support for the website.",
  "Bu, onlayn satış üçün nəzərdə tutulmuş veb səhifədir. Layihədə TypeScript, Framer Motion, komponent əsaslı arxitektura və digər müasir React texnologiyalarından istifadə olunmuşdur. Bouquet üçün admin panel sıfırdan hazırlayıram": "This is a web page intended for online sales. The project uses TypeScript, Framer Motion, component-based architecture, and other modern React technologies. I am developing the admin panel for Bouquet from scratch.",
  "Elektronik əşyaların satışı ilə bağlı bir saytdır. Burada backend hissəsin özüm Express.js və MongoDB ilə hazırlamışam. Bu saytı öz üzərim də daha da inkişaf etmək üçün hazırlayıram və davam edir. Və hal hazırda üzərin də düzəlişlər edirəm.": "This is a website about selling electronic items. I have developed the backend myself with Express.js and MongoDB. I am developing this website for further development on my own and it continues. And I am currently making adjustments to it.",
  "Proqramlaşdırmaya yeni başladığım dövrdə HTML, CSS və JavaScript istifadə edərək API sorğuları vasitəsilə sualları çəkən və istifadəçinin cavablarını yoxlayan interaktiv bir Quiz tətbiqi hazırlamışam.": "When I was just starting out in programming, I developed an interactive Quiz application using HTML, CSS, and JavaScript that pulled questions through API requests and checked the user's answers.",
  "HTML, CSS və JavaScript istifadə edərək drag-and-drop funksionallığına malik bir ToDo tətbiqi hazırlamışam. Bu, proqramlaşdırmaya yeni başladığım dövrdə hazırladığım layihələrdən biridir": "I have developed a ToDo application with drag-and-drop functionality using HTML, CSS and JavaScript. This is one of the projects I developed when I was just starting out in programming."
}
