{
  "Əsas bacarıqlar": "Базовые навыки",
  "Tel": "Телефон",
  "Şəhər": "Город",
  "Azərbaycan": "Азербайджан",
  "Təhsil": "Образование",
  "Mən, React, TypeScript və müasir CSS framework-lərindən istifadə edərək ideyaları interaktiv veb təcrübələrə çevirən praktiki təcrübəyə malik bir Frontend Developeram. Piksel dəqiqliyində dizayna, performansa və təmiz koda xüsusi önəm verirəm. Flutter sahəsin də təcrübə qazanmağa və real layihələr də iştirak etməyə həvəsliyəm. Front end developer təcrübəsinə sahib bir developerəm": "Я фронтенд-разработчик с практическим опытом превращения идей в интерактивный веб-опыт с использованием React, TypeScript и современных CSS-фреймворков. Особое внимание уделяю дизайну с точностью до пикселя, производительности и чистоте кода. Стремлюсь получить опыт во Flutter и участвовать в реальных проектах. Я разработчик с опытом работы во фронтенде.",
  "Azerbaijan Dövlət Neft və Sənaye Universiteti": "Азербайджанский государственный университет нефти и промышленности",
  "Kompyuter mühəndisliyi": "Компьютерная инженерия",
  "ASOİU-da təhsil aldığım müddətdə alqoritmlər, verilənlər strukturu, proqram mühəndisliyi və web development sahələrində biliklər əldə etmişəm. Layihələrim vasitəsilə praktiki bacarıqlarımı artırmışam və müxtəlif texnologiyalarla işləmə təcrübəsi qazanmışam.": "Во время обучения в AGUNP я получил знания в области алгоритмов, структур данных, программной инженерии и веб-разработки. Благодаря своим проектам я улучшил практические навыки и приобрёл опыт работы с различными технологиями.",
  "Azərbaycan Dövlət Təhsil və Elm nazirliyi tərəfindən təşkil edilmiş 'CodeForFuture' layihəsin də Front end developer təlimini bitirmişəm. Honour sertifikatı ilə təltif olunmuşam.": "Я прошёл обучение по курсу Frontend-разработчика в рамках проекта 'CodeForFuture', организованного Министерством образования и науки Азербайджана. Был награждён сертификатом с отличием.",
  "Əlaqə saxla": "Связаться с нами",
  "Bu, onlayn satış üçün nəzərdə tutulmuş veb səhifədir. Layihədə TypeScript, Framer Motion, komponent əsaslı arxitektura və digər müasir React texnologiyalarından istifadə olunmuşdur.": "Это веб-сайт, предназначенный для онлайн-продаж. В проекте используются TypeScript, Framer Motion, компонентная архитектура и другие современные технологии React.",
  "Bu, müxtəlif mebel məhsullarının onlayn satışını təmin edən veb səhifədir. Saytın frontend hissəsi React, TypeScript, Framer Motion və Redux kimi texnologiyalarla qurulmuşdur. Backend isə Express.js və MongoDB istifadə edilərək hazırlanmışdır. Saytda məhsul filtrasiyası, kateqoriya əsaslı axtarış, istifadəçi hesabları, səbət funksionallığı və dinamik animasiyalar mövcuddur.": "Это веб-сайт для онлайн-продажи различных мебельных товаров. Фронтенд сайта разработан с использованием таких технологий, как React, TypeScript, Framer Motion и Redux. Бэкенд разработан с использованием Express.js и MongoDB. На сайте реализованы фильтрация товаров, поиск по категориям, учетные записи пользователей, функциональность корзины и динамичные анимации.",
  "React-da yaratdğım bu saytda json obyekt üzərin də işləyərək məlumatları gətirib səhifə də göstərmişəm. Json obyekt içərisin də axtarış etmək, səbətə məhsul əlavə etmək, silmək, sayını artırıb-azaltmaq, ümumi qiyməti görmək üçün bu funksiyaları etmişəm.": "На этом сайте, созданном мной с использованием React, я работал с JSON-объектами и выводил данные на страницу. Реализованы функции поиска в JSON-объекте, добавления товаров в корзину, удаления, изменения количества и отображения общей стоимости.",
  "AMO Corporate Group üçün hazırladığım veb sayt React və TypeScript ilə yazılmışdır. Hal-hazırda deploy olunmayıb. Gözlənilir.": "Веб-сайт, разработанный мной для AMO Corporate Group, написан на React и TypeScript. В настоящее время не развернут. Ожидается.",
  "'Coza Store' adlanan bu E-Commerce veb səhifəsini Fake Store API-dan istifadə edərək hazırlamışam. Layihəni React ilə həyata keçirmişəm. Autentifikasiya və autorizasiya əməliyyatlarını Node JS ilə icra etmişəm. Github-dan endirərək serveri başladıb baxa bilərsiz": "Этот сайт электронной коммерции под названием 'Coza Store' я разработал с использованием Fake Store API. Проект реализован с помощью React. Аутентификация и авторизация выполнены с использованием Node JS. Вы можете скачать его с GitHub и запустить сервер, чтобы посмотреть.",
  "Burada şəhərlər üzrə axtarış edərək hava şəraitini göstərir.": "Здесь отображается погода по городам, которые можно искать.",
  "Burada istədiyiniz kinoları axtarış edə bilərsiz. Kinonu listə əlavə edə bilərsiz. Listin adını qoya bilərsiz. Kinonun omdbAPİ-a gedib o kinonu göstərir.": "Здесь вы можете искать фильмы, добавлять их в список, давать списку название и просматривать фильмы с помощью OMDB API.",
  "TypeScript-də yeni başladığım üçün sadə dizayn bir todo list app düzəltməyi fikirləşdim. Sadə olmasa da düzəltməyi bacardıq. Redux-toolkit istifadə edərək ərsəyə gətirdim": "Так как я только начал работать с TypeScript, я решил создать простое приложение для списка задач. Хотя оно и не такое простое, я смог его реализовать с помощью Redux Toolkit.",
  "Təcrübə": "Опыт",
  "Keçid et": "Перейти",
  "• React.js, TypeScript, Material UI, Tailwind CSS istifadə edərək API-larla işləyən modern veb sayt hazırladım.\n• Müştəri tələblərinə uyğun şəkildə adaptiv və funksional interfeyslər dizayn etdim.\n• Framer motion vasitəsilə animasiyalı veb saytlar hazırladım": "• Я разработал современный веб-сайт, работающий с API, используя React.js, TypeScript, Material UI, Tailwind CSS.\n• Создавал адаптивные и функциональные интерфейсы в соответствии с требованиями клиентов.\n• Разрабатывал анимированные веб-сайты с помощью Framer Motion.",
  "• React.js, TypeScript, Material UI, Tailwind CSS istifadə edərək API-larla işləyən modern veb sayt hazırladım.\n• Web API-lərlə inteqrasiya olunmuş real layihələr üzərində işlədim.\n• Bitrix24-ün Web API-ları ilə işlədim. \n• ERP və CRM sistemləri ilə tanış oldum.\n• Bitrix24 və Odoo platformaları ilə işlədim.": "• Я разработал современный веб-сайт, работающий с API, используя React.js, TypeScript, Material UI, Tailwind CSS.\n• Работал над реальными проектами, интегрированными с Web API.\n• Работал с Web API Bitrix24. \n• Ознакомился с ERP и CRM системами.\n• Работал с платформами Bitrix24 и Odoo.",
  "• HTML, CSS və JavaScript istifadə edərək müxtəlif səhifələr və komponentlər hazırladım.\n• Verilən tapşırıqları vaxtı vaxtında yerinə yetirdim\n": "• Я разработал различные страницы и компоненты, используя HTML, CSS и JavaScript.\n• Выполнял поставленные задачи вовремя\n",
  "Əlaqə Saxla": "Связаться с нами",
  "Ad": "Имя",
  "Mövzu": "Тема",
  "Mesaj": "Сообщение",
  "Mesaj göndər": "Отправить сообщение",
  "Ölkə": "Страна",
  "Küçə": "Улица",
  "Ö.F. Nemanzadə küç 28": "Улица О.Ф. Неманзаде, 28",
  "Bu mobil applikasiya da api-dan gələn hava məlumatını ekranda göstərmişəm. Burada dio paketindən istifadə edərək, məlumatları gətirmişəm. Geolocator və geocoding vasitəsilə istifadəçinin məkanını alıb istək atmışam": "В этом мобильном приложении я отображал погодную информацию с API. Использовал пакет dio для получения данных. С помощью Geolocator и Geocoding получал местоположение пользователя и отправлял запрос.",
  "Burada istifadəçi səhifə də aşağı doğru hərəkət elətdirdikcə api-dan məlumatlar gəlir. State management olaraq Provider istifadə etmişəm.": "Здесь, по мере прокрутки страницы пользователем, данные загружаются с API. В качестве управления состоянием использовал Provider.",
  "TigHubad applikasiyasın da söz bazanızı artırmaq üçün lüğət proqramıdı. Burada test işliyərək sözün mənasını tapmaq, sözün deyilişinə qulaq asmaq və lüğətdən söz axtarmaq bu kimi funksionallıqlar düşünürəm. Hələki dizayn hazırlanır": "Приложение TigHubad — это словарь для расширения словарного запаса. Планируются функции: прохождение тестов для нахождения значения слова, прослушивание произношения и поиск слов в словаре. Дизайн ещё в разработке."
}
