{
  "Əsas bacarıqlar": "Базовые навыки",
  "Tel": "Телефон",
  "Şəhər": "Город",
  "Azərbaycan": "Азербайджан",
  "Təhsil": "Образование",
  "Mən, React, TypeScript və müasir CSS framework-lərindən istifadə edərək ideyaları interaktiv veb təcrübələrə çevirən praktiki təcrübəyə malik bir Frontend Developeram. Piksel dəqiqliyində dizayna, performansa və təmiz koda xüsusi önəm verirəm. Flutter sahəsin də təcrübə qazanmağa və real layihələr də iştirak etməyə həvəsliyəm. Front end developer təcrübəsinə sahib bir developerəm": "Я фронтенд-разработчик с практическим опытом превращения идей в интерактивный веб-опыт с использованием React, TypeScript и современных CSS-фреймворков. Особое внимание уделяю дизайну с точностью до пикселя, производительности и чистоте кода. Стремлюсь получить опыт во Flutter и участвовать в реальных проектах. Я разработчик с опытом работы во фронтенде.",
  "Azerbaijan Dövlət Neft və Sənaye Universiteti": "Азербайджанский государственный университет нефти и промышленности",
  "Kompyuter mühəndisliyi": "Компьютерная инженерия",
  "ASOİU-da təhsil aldığım müddətdə alqoritmlər, verilənlər strukturu, proqram mühəndisliyi və web development sahələrində biliklər əldə etmişəm. Layihələrim vasitəsilə praktiki bacarıqlarımı artırmışam və müxtəlif texnologiyalarla işləmə təcrübəsi qazanmışam.": "Во время обучения в AGUNP я получил знания в области алгоритмов, структур данных, программной инженерии и веб-разработки. Благодаря своим проектам я улучшил практические навыки и приобрёл опыт работы с различными технологиями.",
  "Azərbaycan Dövlət Təhsil və Elm nazirliyi tərəfindən təşkil edilmiş 'CodeForFuture' layihəsin də Front end developer təlimini bitirmişəm. Honour sertifikatı ilə təltif olunmuşam.": "Я прошёл обучение по курсу Frontend-разработчика в рамках проекта 'CodeForFuture', организованного Министерством образования и науки Азербайджана. Был награждён сертификатом с отличием.",
  "Əlaqə saxla": "Связаться с нами",
  "Bu, onlayn satış üçün nəzərdə tutulmuş veb səhifədir. Layihədə TypeScript, Framer Motion, komponent əsaslı arxitektura və digər müasir React texnologiyalarından istifadə olunmuşdur.": "Это веб-сайт, предназначенный для онлайн-продаж. В проекте используются TypeScript, Framer Motion, компонентная архитектура и другие современные технологии React.",
  "Bu, müxtəlif mebel məhsullarının onlayn satışını təmin edən veb səhifədir. Saytın frontend hissəsi React, TypeScript, Framer Motion və Redux kimi texnologiyalarla qurulmuşdur. Backend isə Express.js və MongoDB istifadə edilərək hazırlanmışdır. Saytda məhsul filtrasiyası, kateqoriya əsaslı axtarış, istifadəçi hesabları, səbət funksionallığı və dinamik animasiyalar mövcuddur.": "Это веб-сайт для онлайн-продажи различных мебельных товаров. Фронтенд сайта разработан с использованием таких технологий, как React, TypeScript, Framer Motion и Redux. Бэкенд разработан с использованием Express.js и MongoDB. На сайте реализованы фильтрация товаров, поиск по категориям, учетные записи пользователей, функциональность корзины и динамичные анимации.",
  "React-da yaratdğım bu saytda json obyekt üzərin də işləyərək məlumatları gətirib səhifə də göstərmişəm. Json obyekt içərisin də axtarış etmək, səbətə məhsul əlavə etmək, silmək, sayını artırıb-azaltmaq, ümumi qiyməti görmək üçün bu funksiyaları etmişəm.": "На этом сайте, созданном мной с использованием React, я работал с JSON-объектами и выводил данные на страницу. Реализованы функции поиска в JSON-объекте, добавления товаров в корзину, удаления, изменения количества и отображения общей стоимости.",
  "AMO Corporate Group üçün hazırladığım veb sayt React və TypeScript ilə yazılmışdır. Hal-hazırda deploy olunmayıb. Gözlənilir.": "Веб-сайт, разработанный мной для AMO Corporate Group, написан на React и TypeScript. В настоящее время не развернут. Ожидается.",
  "'Coza Store' adlanan bu E-Commerce veb səhifəsini Fake Store API-dan istifadə edərək hazırlamışam. Layihəni React ilə həyata keçirmişəm. Autentifikasiya və autorizasiya əməliyyatlarını Node JS ilə icra etmişəm. Github-dan endirərək serveri başladıb baxa bilərsiz": "Этот сайт электронной коммерции под названием 'Coza Store' я разработал с использованием Fake Store API. Проект реализован с помощью React. Аутентификация и авторизация выполнены с использованием Node JS. Вы можете скачать его с GitHub и запустить сервер, чтобы посмотреть.",
  "Burada şəhərlər üzrə axtarış edərək hava şəraitini göstərir.": "Здесь отображается погода по городам, которые можно искать.",
  "Burada istədiyiniz kinoları axtarış edə bilərsiz. Kinonu listə əlavə edə bilərsiz. Listin adını qoya bilərsiz. Kinonun omdbAPİ-a gedib o kinonu göstərir.": "Здесь вы можете искать фильмы, добавлять их в список, давать списку название и просматривать фильмы с помощью OMDB API.",
  "TypeScript-də yeni başladığım üçün sadə dizayn bir todo list app düzəltməyi fikirləşdim. Sadə olmasa da düzəltməyi bacardıq. Redux-toolkit istifadə edərək ərsəyə gətirdim": "Так как я только начал работать с TypeScript, я решил создать простое приложение для списка задач. Хотя оно и не такое простое, я смог его реализовать с помощью Redux Toolkit.",
  "İstifadəçi və idarəçi təcrübəsini nəzərə alaraq funksional və istifadəsi rahat admin panel hazırladım. Paneldə dashboard, məhsullar, seçilmişlər və digər idarəetmə bölmələri yer alır. Məlumatların vizualizasiyası üçün chart komponentlərindən istifadə etdim. Paneldə responsiv dizayn, təkrar istifadə oluna bilən komponentlər, və modul əsaslı arxitektura tətbiq edilmişdir.": "Я разработал(а) функциональную и удобную админ-панель, учитывая опыт как пользователей, так и администраторов. В панели представлены такие разделы, как дашборд, товары, избранное и другие модули управления. Для визуализации данных я использовал(а) компоненты диаграмм. В панели реализован адаптивный дизайн, повторно используемые компоненты и модульная архитектура.",
  "Təcrübə": "Опыт",
  "Keçid et": "Перейти",
  "ERP sistemlərinin hazırlanmasında iştirak.\n React və React Native əsaslı layihələrin inkişaf etdirilməsi.\n Mobil tətbiqlərin dizayn və funksionallıqlarının hazırlanması.\n Əməkdaş şirkətlərin veb saytlarına texniki dəstək göstərilməsi.\n Komanda ilə birgə veb saytların hazırlanması və təkmilləşdirilməsi.\n Figma dizaynlarına uyğun şəkildə veb və mobil interfeyslərin tərtibatı.\n API inteqrasiyalarının həyata keçirilməsi.\n Backend developer ilə koordinasiyalı şəkildə işləmək.\n Kod strukturunun optimallaşdırılması və səliqəli şəkildə saxlanılması.\n Hazır şablonlar üzərində uyğunlaşdırılmış dəyişikliklərin edilməsi.": "Участие в разработке ERP-систем.\n Разработка проектов на основе React и React Native.\n Подготовка дизайна и функционала мобильных приложений.\n Оказание технической поддержки веб-сайтам партнёрских компаний.\n Совместная с командой разработка и улучшение веб-сайтов.\n Верстка веб- и мобильных интерфейсов в соответствии с дизайнами Figma.\n Реализация интеграций с API.\n Тесное взаимодействие с backend-разработчиками.\n Оптимизация структуры кода и поддержание его в чистом и аккуратном виде.\n Внесение адаптированных изменений на основе готовых шаблонов.",
  "Responsiv və mobil uyğun interfeyslər hazırlamaq.\n Modul və təkrar istifadə oluna bilən UI komponentlər hazırlamaq.\n Backend API-larla inteqrasiya etmək və verilənləri vizuallaşdırmaq.\n Kodun təkrar yazılmamasına və tətbiqin optimizasiyasını yerinə yetirmək.": "Создание адаптивных и мобильных интерфейсов.\nРазработка модульных и многократно используемых UI-компонентов.\nИнтеграция с backend API и визуализация данных.\nИзбежание дублирования кода и выполнение оптимизации приложения.",
  "Veb tətbiqləri figma dizaynına uyğun yazılması və müştəri istəyinə uyğun hazırlanması.\n Müştəri tələblərinə uyğun yeni funksionallıqların əlavə edilməsi.\n Sayt üzərində yaranan xətaların aradan qaldırılması və optimizasiya işlərinin görülməsi.\n Layihələrin düzgün işləməsi üçün texniki dəstəyin göstərilməsi və komanda ilə koordinasiya.\n Komanda ilə sıx əməkdaşlıq edərək inteqrasiya olunmuş API lərlə məlumat axınını uğurla idarə etdim.\n Layihə idarəetmə alətlərindən (Trello) istifadə edərək taskları yerinə yetirmək.\n Bitbucket və digər versiya nəzarət sistemlərindən istifadə edərək layihələrin idarə olunması\n API inteqrasiyaları ilə dinamik məlumat axınının təmin olunması. yuxarda yazdigim description icindekini bununla evez et eynisi": "Я разрабатывал(а) веб-приложения в соответствии с дизайнами Figma и адаптировал(а) их под требования клиентов.\nРеализовывал(а) новые функциональные возможности в соответствии с запросами клиента.\nУстранял(а) ошибки на сайте и проводил(а) необходимые работы по оптимизации.\nОбеспечивал(а) техническую поддержку для стабильной работы проектов и координировал(а) действия с командой.\nУспешно управлял(а) потоками данных через интегрированные API в сотрудничестве с командой.\nИспользовал(а) инструменты управления проектами, такие как Trello, для выполнения задач.\nУправлял(а) проектами с помощью Bitbucket и других систем контроля версий.\nОбеспечивал(а) динамический поток данных с помощью корректной интеграции API.",
  "React.js, TypeScript, Material UI, Tailwind CSS istifadə edərək API-larla işləyən modern veb sayt hazırladım.\n Web API-lərlə inteqrasiya olunmuş real layihələr üzərində işlədim.\n Bitrix24-ün Web API-ları ilə işlədim. \n ERP və CRM sistemləri ilə tanış oldum.\n Bitrix24 və Odoo platformaları ilə işlədim.": "Я разработал современный веб-сайт, работающий с API, используя React.js, TypeScript, Material UI и Tailwind CSS.\nЯ работал над реальными проектами, интегрированными с Web API.\nЯ работал с Web API Bitrix24.\nЯ ознакомился с ERP и CRM системами.\nЯ работал с платформами Bitrix24 и Odoo.",
  "HTML, CSS və JavaScript istifadə edərək müxtəlif səhifələr və komponentlər hazırladım.\n Verilən tapşırıqları vaxtı vaxtında yerinə yetirdim": "Я разработал различные страницы и компоненты, используя HTML, CSS и JavaScript.\n Выполнял поставленные задачи вовремя",
  "Əlaqə Saxla": "Связаться с нами",
  "Ad": "Имя",
  "Mövzu": "Тема",
  "Mesaj": "Сообщение",
  "Mesaj göndər": "Отправить сообщение",
  "Ölkə": "Страна",
  "Küçə": "Улица",
  "Ö.F. Nemanzadə küç 28": "Улица О.Ф. Неманзаде, 28",
  "Bu mobil applikasiya da api-dan gələn hava məlumatını ekranda göstərmişəm. Burada dio paketindən istifadə edərək, məlumatları gətirmişəm. Geolocator və geocoding vasitəsilə istifadəçinin məkanını alıb istək atmışam": "В этом мобильном приложении я отображал погодную информацию с API. Использовал пакет dio для получения данных. С помощью Geolocator и Geocoding получал местоположение пользователя и отправлял запрос.",
  "Burada istifadəçi səhifə də aşağı doğru hərəkət elətdirdikcə api-dan məlumatlar gəlir. State management olaraq Provider istifadə etmişəm.": "Здесь, по мере прокрутки страницы пользователем, данные загружаются с API. В качестве управления состоянием использовал Provider.",
  "TigHubad applikasiyasın da söz bazanızı artırmaq üçün lüğət proqramıdı. Burada test işliyərək sözün mənasını tapmaq, sözün deyilişinə qulaq asmaq və lüğətdən söz axtarmaq bu kimi funksionallıqlar düşünürəm. Hələki dizayn hazırlanır": "Приложение TigHubad — это словарь для расширения словарного запаса. Планируются функции: прохождение тестов для нахождения значения слова, прослушивание произношения и поиск слов в словаре. Дизайн ещё в разработке.",
  "Bu sayt kitabların satışı üçün nəzərdə tutulmuşdur. Saytın frontend hissəsi React, TypeScript, Framer Motion və Redux kimi texnologiyalarla qurulmuşdur. Backend isə firebase authentication üçün və supabase isə storage üçün istifadə etmişəm.": "Этот сайт предназначен для продажи книг. Интерфейс сайта создан с использованием таких технологий, как React, TypeScript, Framer Motion и Redux. Я использовал Firebase для аутентификации и Supabase для хранения.",
  "Bu mobil applikasiyada Rick and Morty seriyasının personajlarını göstərmişəm. Burada dio paketindən istifadə edərək, məlumatları gətirmişəm. Rick and Morty API-dan istifadə etmişəm. Personajların şəkillərini, adlarını, statusunu, növünü göstərmişəm. Həmçinin personajın üzərinə kliklədikdə onun haqqında ətraflı məlumatları göstərir.": "В этом мобильном приложении я показал персонажей из сериала «Рик и Морти». Здесь я импортировал данные с помощью пакета dio. Я использовал API Рика и Морти. Я показал фотографии персонажей, их имена, статус и тип. При нажатии на персонажа также отображается подробная информация о нем.",
  "Bu, onlayn kredit xidmətləri üçün hazırlanmış veb səhifədir. Mövcud kod bazası üzərində əlavə funksionallıqlar yaratmışam və layihəni davamlı olaraq təkmilləşdirirəm. Və admin panel üzərin də işlər də davam edir": "Это веб-страница, предназначенная для онлайн-кредитных услуг. Я добавил дополнительные функции поверх существующей кодовой базы и постоянно улучшаю проект. Работы над админ-панелью также продолжаются.",
  "Bu, ParkCinema layihəsi üçün hazırlanmış veb tətbiqidir. Mövcud kod bazası üzərində işlər aparıram, yeni funksionallıqlar əlavə edir və saytın davamlı dəstəyi üçün çalışıram.": "Это веб-приложение, разработанное для проекта ParkCinema. Я работаю с существующей кодовой базой, добавляю новые функции и обеспечиваю постоянную поддержку сайта.",
  "Bu, onlayn satış üçün nəzərdə tutulmuş veb səhifədir. Layihədə TypeScript, Framer Motion, komponent əsaslı arxitektura və digər müasir React texnologiyalarından istifadə olunmuşdur. Bouquet üçün admin panel sıfırdan hazırlayıram": "Это веб-страница, предназначенная для онлайн-продаж. В проекте используются TypeScript, Framer Motion, компонентная архитектура и другие современные технологии React. Админ-панель для Bouquet я разрабатываю с нуля.",
  "Elektronik əşyaların satışı ilə bağlı bir saytdır. Burada backend hissəsin özüm Express.js və MongoDB ilə hazırlamışam. Bu saytı öz üzərim də daha da inkişaf etmək üçün hazırlayıram və davam edir. Və hal hazırda üzərin də düzəlişlər edirəm.": "Это сайт о продаже электроники. Я сам разработал бэкенд с использованием Express.js и MongoDB. Я разрабатываю этот сайт самостоятельно, и он продолжает развиваться. Сейчас я вношу в него изменения.",
  "Proqramlaşdırmaya yeni başladığım dövrdə HTML, CSS və JavaScript istifadə edərək API sorğuları vasitəsilə sualları çəkən və istifadəçinin cavablarını yoxlayan interaktiv bir Quiz tətbiqi hazırlamışam.": "Когда я только начинал заниматься программированием, я разработал интерактивное приложение-викторину с использованием HTML, CSS и JavaScript, которое выдавало вопросы через запросы API и проверяло ответы пользователя.",
  "HTML, CSS və JavaScript istifadə edərək drag-and-drop funksionallığına malik bir ToDo tətbiqi hazırlamışam. Bu, proqramlaşdırmaya yeni başladığım dövrdə hazırladığım layihələrdən biridir": "Я разработал приложение ToDo с функцией перетаскивания, используя HTML, CSS и JavaScript. Это один из проектов, над которым я работал, когда только начинал программировать.",
  "Browser extensionn": "Расширение браузера",
  "Burada həm backend, həm də Next.js biliklərimi artırmaq üçün sadə bir browser extension hazırladım. Layihə də backend hissəsin express.js, prisma istifadə etdim. Frontend hissə də isə Next.js ilə server tərəfdə api-a istək atmaq və client tərəfdə dataları göstərə bilmək. Və browser extension yaratmaq üçün form hazırladım. Loqoları buluda daşıdım və orada saxladım": "Здесь я создал простое расширение браузера для улучшения как моих знаний в backend, так и в Next.js. В проекте я использовал Express.js и Prisma для backend части. Для frontend части я использовал Next.js для отправки API-запросов на серверной стороне и отображения данных на клиентской стороне. Я также создал форму для создания расширений браузера. Я загрузил логотипы в облако и сохранил их там."
}
